{
  "imvaders": [
    {
      "title": "Understanding Observability",
      "content": "Observability is a critical concept for modern IT systems, enabling teams to monitor and analyze the performance of distributed architectures. In this section, you’ll learn about the three pillars of observability—metrics, traces, and logs—and how they work together to provide actionable insights. Metrics help you understand system health over time, logs capture detailed event data, and traces allow for end-to-end visibility into user transactions across services. By mastering these concepts, you’ll be equipped to diagnose issues, improve reliability, and optimize performance.",
      "hyperlink": "https://docs.splunk.com/Observability_Basics"
    },
    {
      "title": "Getting Started with Splunk Observability",
      "content": "This section guides you through setting up your first Splunk Observability environment. You’ll learn how to install the OpenTelemetry Collector, configure integrations for your infrastructure, and begin collecting data. Additionally, you’ll explore the Splunk Observability interface, including how to set up dashboards and alerts to visualize system health. By the end of this section, you’ll have a functioning observability environment tailored to your needs.",
      "hyperlink": "https://docs.splunk.com/Getting_Started_Observability"
    },
    {
      "title": "Metrics and Dashboards",
      "content": "Metrics are the foundation of observability, offering real-time insights into system performance. In this section, you’ll learn how to collect, analyze, and visualize metrics using Splunk Observability. You’ll also explore best practices for building custom dashboards, including using chart types, defining thresholds, and configuring alerting rules. By creating tailored dashboards, you’ll empower teams to quickly identify and address performance issues.",
      "hyperlink": "https://docs.splunk.com/Metrics_and_Dashboards"
    },
    {
      "title": "Troubleshooting with Logs and Traces",
      "content": "Logs and traces are essential for diagnosing and resolving system issues. This section focuses on using Splunk Log Observer to search and analyze logs in real-time and Splunk APM (Application Performance Monitoring) to trace requests across distributed services. You’ll learn how to connect logs with traces to identify root causes of latency, errors, or failures. This integrated approach ensures you can resolve issues quickly and improve service reliability.",
      "hyperlink": "https://docs.splunk.com/Log_Observer"
    }
  ],
  "logger": [
    {
      "title": "Advanced Metrics Analysis",
      "content": "Proactively identifying issues before they impact users is a key goal of observability. In this section, you’ll explore advanced metric analysis techniques, including anomaly detection, predictive analytics, and custom threshold configurations. You’ll learn how Splunk Observability uses machine learning to surface potential issues and how to configure alerts to notify the right teams at the right time.",
      "hyperlink": "https://docs.splunk.com/Advanced_Metrics"
    },
    {
      "title": "Optimizing Application Performance",
      "content": "Splunk APM provides deep visibility into application performance by tracing user transactions across services and correlating them with logs and metrics. You’ll learn how to configure OpenTelemetry instrumentation to capture data about requests, response times, and error rates. This section also covers how Splunk APM processes and stores this data, making it available for advanced analysis and visualizations.",
      "hyperlink": "https://docs.splunk.com/APM_Optimization"
    },
    {
      "title": "Distributed Tracing Deep Dive",
      "content": "Distributed tracing is essential for monitoring microservices architectures. This section explores how to use OpenTelemetry to capture spans and traces that map out complex interactions between services. You’ll learn to identify bottlenecks, debug service dependencies, and correlate traces with logs to improve troubleshooting.",
      "hyperlink": "https://docs.splunk.com/Distributed_Tracing"
    },
    {
      "title": "Custom Integrations and Automation",
      "content": "Integrate Splunk Observability Suite with third-party tools like PagerDuty and ServiceNow to streamline incident response. This section covers how to configure webhook integrations, automate workflows, and set up custom alerting logic for specific use cases. By automating these processes, you’ll reduce response times and improve operational efficiency.",
      "hyperlink": "https://docs.splunk.com/Integrations"
    }
  ],
  "bughunt": [
    {
      "title": "Advanced Metrics Analysis",
      "content": "Proactively identifying issues before they impact users is a key goal of observability. In this section, you’ll explore advanced metric analysis techniques, including anomaly detection, predictive analytics, and custom threshold configurations. You’ll learn how Splunk Observability uses machine learning to surface potential issues and how to configure alerts to notify the right teams at the right time.",
      "hyperlink": "https://docs.splunk.com/Advanced_Metrics"
    }
  ]
}
